# შექმენით კალკულატორის ფუნქცია  რომელიც მომხმარებელს შეეკითხება ორ რიცხვს 
# და მოქმედების ტიპს(მიმატება, გამოკლება, გამრავლება, გაყოფა) შესაბამისად ფუნქცია
# დააბრუნებს ანუ დაბეჭდავს შედეგს იმისდამიხედვით მომხმარებელს რა სურს და რა რიცხვები
# შემოიტანა, მაგალითად მომხმარებელმა თუ შემოიტანა 5 და 2 და ასევე მას სურს გამრავლება 
# ფუნქციამ უნდა დააბრუნოს დაბეჭდოს შედეგად 2 * 5 ანუ 10

def calculator():
    num1 = int(input("შეიყვანეთ პირველი რიცხვი: "))
    
    num2 = int(input("შეიყვანეთ მეორე რიცხვი: "))
    
    operation = input("შეიყვანეთ მოქმედების ტიპი (მიმატება, გამოკლება, გამრავლება, გაყოფა): ").strip().lower()
    
    if operation == "მიმატება":
        result = num1 + num2
        print(f"{num1} + {num2} = {result}")
    elif operation == "გამოკლება":
        result = num1 - num2
        print(f"{num1} - {num2} = {result}")
    elif operation == "გამრავლება":
        result = num1 * num2
        print(f"{num1} * {num2} = {result}")
    elif operation == "გაყოფა":
        if num2 != 0:
            result = num1 / num2
            print(f"{num1} / {num2} = {result}")
        else:
            print("გთხოვთ, არ გამოიყენოთ ნულით გაყოფა!")
    else:
        print("არასწორი მოქმედების ტიპი! უნდა იყოს: მიმატება, გამოკლება, გამრავლება, გაყოფა.")

calculator()